/*
	Final Fantasy VII
	(c) 1997 Square
	decompiled by ergonomy_joe in 2018
*/
//Chocobo --

#include "ff7.h"
#include "chocobo_data.h"
#include "menu_data.h"

#include <time.h>
////////////////////////////////////////
struct t_chocobo_local_quad_2 {
	/*00*/struct t_g_drv_0c vert_0;
	/*0c*/struct t_g_drv_0c vert_1;
	/*18*/struct t_g_drv_0c vert_2;
	/*24*/struct t_g_drv_0c vert_3;
	/*30*/float fU_0,fV_0;
	/*38*/float fU_1,fV_1;
	/*40*/float fU_2,fV_2;
	/*48*/float fU_3,fV_3;
};
////////////////////////////////////////
extern struct t_chocobo_48 D_00E3B908;
extern LARGE_INTEGER D_00E3BA30;
extern LARGE_INTEGER D_00E3BA38;
extern int D_00E3BA8C;
extern double D_00E3BAC0;
extern int D_00E3BAC8;
extern int D_00E3BAD0;//endgame flag?
extern int D_00E3BAD4;

extern int D_00E70FE8;
extern int D_00E71018;
extern int D_00E71020[/*6*/];//"visible chocobo" flags
extern int D_00E71038;
extern int D_00E710E0;
extern int D_00E710EC;//fade:current alpha
extern int D_00E710F8;

extern int D_00E715D4;//fade:alpha incr
extern int D_00E715D8;//counter before start
extern struct t_chocobo_data_18 *D_00E715FC;

extern struct t_chocobo_local_1c D_00E72DF0;
////////////////////////////////////////
struct MATRIX D_00E73DB0;
unsigned char D_00E73DD0;
//00E73DD4~
D3DMATRIX D_00E73E60;
//00E73EA0~
double D_00E73EE0;
int D_00E73EE8;
int D_00E73EEC;
struct t_chocobo_data_18 *D_00E73EF0;
int D_00E73EF4;
int D_00E73EF8;
int D_00E73EFC;
